In [3]:
import pandas as pd
import numpy as np

关于date_range()函数

In [32]:
pd.set_option('display.width',150)

In [33]:
dates = pd.date_range('2018-01-01',periods=7)

In [34]:
dates

DatetimeIndex(['2018-01-01', '2018-01-02', '2018-01-03', '2018-01-04', '2018-01-05', '2018-01-06', '2018-01-07'], dtype='datetime64[ns]', freq='D')

只要是能转换成Series的对象，都可以用于创建DataFrame：

In [35]:
df = pd.DataFrame({'A':1, 'B':pd.Timestamp('20180901'),'C':pd.Series(2.11, index=list(range(3)),dtype='float64'),
                   'D':np.array([3]*3,dtype='int64'),'E':'hello pandas'})

In [36]:
df

   A          B     C  D             E
0  1 2018-09-01  2.11  3  hello pandas
1  1 2018-09-01  2.11  3  hello pandas
2  1 2018-09-01  2.11  3  hello pandas

In [37]:
df.shape #查看形状

(3, 5)

关于dataframe.describe()函数提供了DateFrame纯数值数据的统计

In [38]:
df.describe()

         A     C    D
count  3.0  3.00  3.0
mean   1.0  2.11  3.0
std    0.0  0.00  0.0
min    1.0  2.11  3.0
25%    1.0  2.11  3.0
50%    1.0  2.11  3.0
75%    1.0  2.11  3.0
max    1.0  2.11  3.0

排序1：DataFrame提供了两种形式的排序。一种是按行列排序，即按照索引（行名）或者列名进行排序，可调用dataframe.sort_index，
指定axis=0表示按索引（行名）排序，axis=1表示按列名排序，并可指定升序或者降序：

In [4]:
df2 = pd.DataFrame(np.arange(20).reshape(5,4),columns=['a','b','c','d'])

In [45]:
df2

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

In [46]:
df2.sort_index(axis=0,ascending=False) #按行排序，降序

    a   b   c   d
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [48]:
df2.sort_index(axis=1,ascending=False) #按列排序，降序，若asecending=True即为升序

    d   c   b   a
0   3   2   1   0
1   7   6   5   4
2  11  10   9   8
3  15  14  13  12
4  19  18  17  16

排序2：按值排序，用sort()函数，
可指定列名和排序方式，默认的是升序排序

In [54]:
?df2.sort_values()

In [59]:
df2.sort_values(by=['b','c'],ascending=False) #按照b,c列的值进行降序排序

    a   b   c   d
4  16  17  18  19
3  12  13  14  15
2   8   9  10  11
1   4   5   6   7
0   0   1   2   3

In [70]:
df2.sort_values(by='c',ascending=True)  #按c列的值进行排序，升序

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19

数据的访问， loc针对属性索引、iloc针对index索引、at、iat、ix

In [74]:
?df.loc

In [77]:
df2.loc[1]

a    4
b    5
c    6
d    7
Name: 1, dtype: int32

In [79]:
df2.loc[0:2] #属性是包含2的

   a  b   c   d
0  0  1   2   3
1  4  5   6   7
2  8  9  10  11

In [84]:
df2.iloc[0:2] #index索引是不包括2

   a  b  c  d
0  0  1  2  3
1  4  5  6  7

In [90]:
df2.iloc[0:2,1:3]

   b  c
0  1  2
1  5  6

In [92]:
df2[df2.a>df2.a.mean()] #还可以利用数学函数取出a列里面大于a列均值的值

    a   b   c   d
3  12  13  14  15
4  16  17  18  19

isin()函数可方便地过滤DataFrame中的数据

In [102]:
df2.isin([0,4,18])

       a      b      c      d
0   True  False  False  False
1   True  False  False  False
2  False  False  False  False
3  False  False  False  False
4  False  False   True  False

In [104]:
df2.loc[0].isin([2,3]) #第一行里面是否存在2,3

a    False
b    False
c     True
d     True
Name: 0, dtype: bool

在访问数据的基础上，我们可以更改数据，例如，修改某些元素为缺失值

In [107]:
df2['b'][df2['c']==6]=np.nan   #修改c列值为6的行所在的b列数值为缺失值

In [108]:
df2

    a     b   c   d
0   0   1.0   2   3
1   4   NaN   6   7
2   8   9.0  10  11
3  12  13.0  14  15
4  16  17.0  18  19

In [110]:
?df2.dropna

In [111]:
df2.dropna() #丢弃具有缺失值的行

    a     b   c   d
0   0   1.0   2   3
2   8   9.0  10  11
3  12  13.0  14  15
4  16  17.0  18  19

In [113]:
df2.dropna(how='all') #丢弃某行全部是缺失值的行

    a     b   c   d
0   0   1.0   2   3
1   4   NaN   6   7
2   8   9.0  10  11
3  12  13.0  14  15
4  16  17.0  18  19

填补缺失值

In [114]:
df2.fillna(value=100)

    a      b   c   d
0   0    1.0   2   3
1   4  100.0   6   7
2   8    9.0  10  11
3  12   13.0  14  15
4  16   17.0  18  19

使用append可以在Series后添加元素，以及在DataFrame尾部添加一行

In [116]:
df2

    a     b   c   d
0   0   1.0   2   3
1   4   NaN   6   7
2   8   9.0  10  11
3  12  13.0  14  15
4  16  17.0  18  19

In [120]:
df2.append(df2.iloc[1])

      a     b     c     d
0   0.0   1.0   2.0   3.0
1   4.0   NaN   6.0   7.0
2   8.0   9.0  10.0  11.0
3  12.0  13.0  14.0  15.0
4  16.0  17.0  18.0  19.0
1   4.0   NaN   6.0   7.0

In [5]:
df2.append(df2.iloc[1],ignore_index=True)

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15
4  16  17  18  19
5   4   5   6   7